# Wire Type Temperature Rating Property

Source: https://www.revitapidocs.com/2026/96eda530-ab34-3812-8d94-49e141330011.htm

---

| Wire Type Temperature Rating Property |
| --- |

The conductor temperature rating of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId TemperatureRating { get; set; }
```

```
Public Property TemperatureRating As ElementId
	Get
	Set
```

```
public:
property ElementId^ TemperatureRating {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member TemperatureRating : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a conductor temperature rating id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

WireType Class Autodesk.Revit.DB.Electrical Namespace